{
  "format": "graph-model",
  "generatedBy": "2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "224"
            },
            {
              "size": "224"
            },
            {
              "size": "3"
            }
          ]
        }
      }
    },
    "outputs": {
      "minimum": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "1"
            }
          ]
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "input_1",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "224"
                },
                {
                  "size": "224"
                },
                {
                  "size": "3"
                }
              ]
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/stem_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block6d_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "192"
                  },
                  {
                    "size": "1152"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/stem_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/stem_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/stem_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block6d_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1152"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block6d_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "5"
                  },
                  {
                    "size": "5"
                  },
                  {
                    "size": "1152"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block1a_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "16"
                  },
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block6d_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1152"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "16"
                  },
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "96"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "96"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "96"
                  },
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "96"
                  },
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2a_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "24"
                  },
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "24"
                  },
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/top_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1280"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block2b_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "24"
                  },
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "24"
                  },
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block6d_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "5"
                  },
                  {
                    "size": "5"
                  },
                  {
                    "size": "1152"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "5"
                  },
                  {
                    "size": "5"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block6d_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1152"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "5"
                  },
                  {
                    "size": "5"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "40"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "40"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_project_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "40"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3a_project_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "40"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "40"
                  },
                  {
                    "size": "240"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "240"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_expand_conv/StatefulPartitionedCall/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "40"
                  },
                  {
                    "size": "240"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_expand_conv/StatefulPartitionedCall/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "240"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "5"
                  },
                  {
                    "size": "5"
                  },
                  {
                    "size": "240"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/ff1fe8d48e3c45a1b58f9cae3ad95deb/StatefulPartitionedCall/StatefulPartitionedCall/sequential/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "240"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_dwconv/StatefulPartitionedCall/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "5"
                  },
                  {
                    "size": "5"
                  },
                  {
                    "size": "240"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/1e9cafc363934eb1b8c67ca3830c5901/StatefulPartitionedCall/StatefulPartitionedCall/sequential_3/StatefulPartitionedCall/efficientnetb0/StatefulPartitionedCall/block3b_dwconv/StatefulPartitionedCall/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
